
// нет примитивных типов - только ссылочные


// Числовые типы чисел соответствуют Java, кроме char
// нет неявных преобразований - меньшие типы не являются подтипами бОльших типов

    // val b: Byte = 1 // порядок, литералы проверяются статически
    // val i: Int = b // ОШИБКА - НУЖНО ЯВНОЕ ПРЕОБРАХОВАНИЕ

// Char
// Boolean
// Array - массив
// String
// Функциональные типы


const val MAX = 5000    // константа времени компиляции
    // аюсолютно неизменяемая переменная
    // объявление и инициализация только одновременно

fun main (args: Array<String>) {

    // поддержка автоматического изменения типов
    // переменные типа val неизменяемы (read-only)
    //val a = "Hello";
    //a = "HelloA"
}